In [1]:
import pandas as pd
df=pd.read_excel('sample_pivot.xlsx')

In [2]:
df.head()

        Date Region                 Type  Units  Sales
0 2020-07-11   East  Children's Clothing   18.0    306
1 2020-09-23  North  Children's Clothing   14.0    448
2 2020-04-02  South     Women's Clothing   17.0    425
3 2020-02-28   East  Children's Clothing   26.0    832
4 2020-03-19   West     Women's Clothing    3.0     33

In [15]:
groupby=df.groupby('Type')['Sales'].max()

In [16]:
print(groupby.head())

Type
Children's Clothing    1122
Men's Clothing         1155
Women's Clothing       1122
Name: Sales, dtype: int64

In [19]:
groupby=df.groupby('Type')['Sales'].nunique()

In [20]:
print(groupby.head())

Type
Children's Clothing    177
Men's Clothing         184
Women's Clothing       239
Name: Sales, dtype: int64